; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_9 ?v3 ?v5)
             (pred_5 ?v9 ?v4)
             (pred_10 ?v3 ?v4)
             (pred_3 ?v2 ?v3 )
	     (pred_12 ?v3)
             (pred_8 ?v7)
             (pred_1 ?v9)
             (pred_4 ?v4)
             (pred_6 ?v3)
             (pred_2 ?v9)
             (pred_7 ?v3)
             (pred_11 ))



(:action op_2
:parameters (?v13 ?v8 ?v6 ?v10)
:precondition (and (pred_8 ?v13) (pred_8 ?v8) (pred_1 ?v6) (pred_4 ?v10)
          (pred_9 ?v13 ?v8) (pred_5 ?v6 ?v10)
                   (pred_10 ?v8 ?v10) (pred_12 ?v13) 
                   (pred_6 ?v8) (pred_2 ?v6))
:effect (and  (pred_7 ?v8) (not (pred_6 ?v8))))


(:action op_5
:parameters (?v13 ?v12)
:precondition (and (pred_8 ?v13) (pred_8 ?v12)
               (pred_12 ?v13) (pred_9 ?v13 ?v12) (pred_7 ?v12))
:effect (and (pred_12 ?v12) (not (pred_12 ?v13))))

(:action op_4
:parameters (?v13 ?v6)
:precondition (and (pred_8 ?v13) (pred_1 ?v6) 
                  (pred_12 ?v13) (pred_3 ?v6 ?v13) (pred_11 ))
:effect (and (pred_2 ?v6)
   (not (pred_3 ?v6 ?v13)) (not (pred_11 ))))


(:action op_3
:parameters (?v13 ?v1 ?v11)
:precondition (and (pred_8 ?v13) (pred_1 ?v1) (pred_1 ?v11)
                  (pred_12 ?v13) (pred_2 ?v11) (pred_3 ?v1 ?v13))
:effect (and (pred_2 ?v1) (pred_3 ?v11 ?v13)
        (not (pred_2 ?v11)) (not (pred_3 ?v1 ?v13))))

(:action op_1
:parameters (?v13 ?v6)
:precondition (and (pred_8 ?v13) (pred_1 ?v6) 
                  (pred_12 ?v13) (pred_2 ?v6))
:effect (and (pred_11 ) (pred_3 ?v6 ?v13) (not (pred_2 ?v6)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_21 obj_13 obj_14 obj_07 obj_16 obj_12 obj_09 obj_15 obj_06 obj_20 obj_10 obj_17 obj_04 obj_02 obj_03 obj_08
    obj_01 obj_05
    obj_19 obj_18 obj_11
    )

    (:init
       (pred_11)

       (pred_8 obj_21)
       (pred_8 obj_13)
       (pred_8 obj_14)
       (pred_8 obj_07)
       (pred_8 obj_16)
       (pred_8 obj_12)
       (pred_8 obj_09)
       (pred_8 obj_15)
       (pred_8 obj_06)
       (pred_8 obj_20)
       (pred_8 obj_10)
       (pred_8 obj_17)
       (pred_8 obj_04)
       (pred_8 obj_02)
       (pred_8 obj_03)
       (pred_8 obj_08)
       (pred_4 obj_01)
       (pred_4 obj_05)
       (pred_1 obj_19)
       (pred_1 obj_18)
       (pred_1 obj_11)

       (pred_9 obj_21 obj_16)
       (pred_9 obj_21 obj_13)
       (pred_9 obj_13 obj_12)
       (pred_9 obj_13 obj_14)
       (pred_9 obj_13 obj_21)
       (pred_9 obj_14 obj_09)
       (pred_9 obj_14 obj_07)
       (pred_9 obj_14 obj_13)
       (pred_9 obj_07 obj_15)
       (pred_9 obj_07 obj_14)
       (pred_9 obj_16 obj_06)
       (pred_9 obj_16 obj_12)
       (pred_9 obj_16 obj_21)
       (pred_9 obj_12 obj_20)
       (pred_9 obj_12 obj_09)
       (pred_9 obj_12 obj_13)
       (pred_9 obj_12 obj_16)
       (pred_9 obj_09 obj_10)
       (pred_9 obj_09 obj_15)
       (pred_9 obj_09 obj_14)
       (pred_9 obj_09 obj_12)
       (pred_9 obj_15 obj_17)
       (pred_9 obj_15 obj_07)
       (pred_9 obj_15 obj_09)
       (pred_9 obj_06 obj_04)
       (pred_9 obj_06 obj_20)
       (pred_9 obj_06 obj_16)
       (pred_9 obj_20 obj_02)
       (pred_9 obj_20 obj_10)
       (pred_9 obj_20 obj_12)
       (pred_9 obj_20 obj_06)
       (pred_9 obj_10 obj_03)
       (pred_9 obj_10 obj_17)
       (pred_9 obj_10 obj_09)
       (pred_9 obj_10 obj_20)
       (pred_9 obj_17 obj_08)
       (pred_9 obj_17 obj_15)
       (pred_9 obj_17 obj_10)
       (pred_9 obj_04 obj_02)
       (pred_9 obj_04 obj_06)
       (pred_9 obj_02 obj_03)
       (pred_9 obj_02 obj_20)
       (pred_9 obj_02 obj_04)
       (pred_9 obj_03 obj_08)
       (pred_9 obj_03 obj_10)
       (pred_9 obj_03 obj_02)
       (pred_9 obj_08 obj_17)
       (pred_9 obj_08 obj_03)
       (pred_6 obj_20)
       (pred_6 obj_06)
       (pred_6 obj_16)
       (pred_10  obj_20 obj_01)
       (pred_10  obj_06 obj_05)
       (pred_10  obj_16 obj_05)
       (pred_7 obj_21)
       (pred_7 obj_13)
       (pred_7 obj_14)
       (pred_7 obj_07)
       (pred_7 obj_12)
       (pred_7 obj_09)
       (pred_7 obj_15)
       (pred_7 obj_10)
       (pred_7 obj_17)
       (pred_7 obj_04)
       (pred_7 obj_02)
       (pred_7 obj_03)
       (pred_7 obj_08)

       (pred_5  obj_19 obj_01)
       (pred_5  obj_18 obj_05)
       (pred_5  obj_11 obj_01)
       (pred_3 obj_19 obj_08)
       (pred_3 obj_18 obj_21)
       (pred_3 obj_11 obj_03)
       (pred_12 obj_12)
    )

    (:goal (and
       (pred_3 obj_11 obj_09)
    ))
(:constraints
  (always (not (pred_12 obj_10)))
)
)

; plan
1. (op_5 obj_12 obj_09)
   deleted: (pred_12 obj_12)
   added: (pred_12 obj_09)
   goals met: 0 of 1
2. (op_5 obj_09 obj_15)
   deleted: (pred_12 obj_09)
   added: (pred_12 obj_15)
   goals met: 0 of 1
3. (op_5 obj_15 obj_17)
   deleted: (pred_12 obj_15)
   added: (pred_12 obj_17)
   goals met: 0 of 1
4. (op_5 obj_17 obj_08)
   deleted: (pred_12 obj_17)
   added: (pred_12 obj_08)
   goals met: 0 of 1
5. (op_5 obj_08 obj_03)
   deleted: (pred_12 obj_08)
   added: (pred_12 obj_03)
   goals met: 0 of 1
6. (op_4 obj_03 obj_11)
   deleted: (pred_3 obj_11 obj_03) (pred_11)
   added: (pred_2 obj_11)
   goals met: 0 of 1
7. (op_5 obj_03 obj_08)
   deleted: (pred_12 obj_03)
   added: (pred_12 obj_08)
   goals met: 0 of 1
8. (op_5 obj_08 obj_17)
   deleted: (pred_12 obj_08)
   added: (pred_12 obj_17)
   goals met: 0 of 1
9. (op_5 obj_17 obj_15)
   deleted: (pred_12 obj_17)
   added: (pred_12 obj_15)
   goals met: 0 of 1
10. (op_5 obj_15 obj_09)
   deleted: (pred_12 obj_15)
   added: (pred_12 obj_09)
   goals met: 0 of 1
11. (op_1 obj_09 obj_11)
   deleted: (pred_2 obj_11)
   added: (pred_11) (pred_3 obj_11 obj_09)
   goals met: 1 of 1
